Repository: mubtAAhij/vibeproxy
Catalog: src/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: es_419

# custom-provider.help.model-aliases.none-configured
source: No model aliases configured yet.
es_419: Aún no hay alias de modelo configurados.

# custom-provider.help.model-aliases.list
source: Models: %@.
es_419: Modelos: %@.

# custom-provider.help.base-url-and-model-summary
source: OpenAI-compatible provider at %@. %@
es_419: Proveedor compatible con OpenAI en %@. %@

# thinking-proxy.error.invalid-request
source: Invalid request
es_419: Solicitud inválida

# thinking-proxy.error.invalid-request-line
source: Invalid request line
es_419: Línea de solicitud inválida

# thinking-proxy.error.invalid-request-format
source: Invalid request format
es_419: Formato de solicitud inválido

# thinking-proxy.error.invalid-request-format.no-body-separator
source: Invalid request format - no body separator
es_419: Formato de solicitud inválido - falta el separador de cuerpo

# thinking-proxy.error.bad-gateway.ampcode-unreachable
source: Bad Gateway - Could not connect to ampcode.com
es_419: Gateway incorrecto - No se pudo conectar a ampcode.com

# thinking-proxy.error.bad-gateway.vercel-ai-gateway-unreachable
source: Bad Gateway - Could not connect to Vercel AI Gateway
es_419: Bad Gateway - No se pudo conectar a Vercel AI Gateway

# thinking-proxy.error.internal-server-error
source: Internal Server Error
es_419: Error Interno del Servidor

# thinking-proxy.error.bad-gateway
source: Bad Gateway
es_419: Puerta de enlace incorrecta

# tunnel-manager.cloudflared-install.message-title
source: Cloudflared Not Installed
es_419: Cloudflared no instalado

# tunnel-manager.cloudflared-install.instructions
source: To expose your server to the internet, you need to install cloudflared. Install via Homebrew: brew install cloudflared Or download from: https://github.com/cloudflare/cloudflared/releases
es_419: Para exponer tu servidor a internet, necesitas instalar cloudflared. Instalar vía Homebrew: brew install cloudflared O descargar desde: https://github.com/cloudflare/cloudflared/releases

# tunnel-manager.cloudflared-install.copy-command
source: Copy Install Command
es_419: Copiar comando de instalación

# common.button.cancel
source: Cancel
es_419: Cancelar

# zai-api-key-store.error.create-auth-directory-failed
source: Failed to create auth directory at %@: %@
es_419: No se pudo crear el directorio de autenticación en %@: %@

# zai-api-key-store.error.serialize-api-key-failed
source: Failed to serialize Z.AI API key: %@
es_419: No se pudo serializar la clave API de Z.AI: %@

# zai-api-key-store.error.write-api-key-file-failed
source: Failed to write Z.AI API key file at %@: %@
es_419: No se pudo escribir el archivo de claves API de Z.AI en %@: %@

# zai-api-key-store.error.unexpected-load-error
source: Unexpected error while loading %@: %@
es_419: Error inesperado al cargar %@: %@

# zai-api-key-store.error.read-api-key-file-failed
source: Failed to read Z.AI API key file at %@: %@
es_419: No se pudo leer el archivo de claves API de Z.AI en %@: %@

# zai-api-key-store.error.invalid-json
source: Z.AI API key file at %@ contains invalid JSON: %@
es_419: El archivo de clave API de Z.AI en %@ contiene JSON no válido: %@

# zai-api-key-store.error.malformed-key.not-json-object
source: Z.AI API key file at %@ must contain a JSON object.
es_419: El archivo de clave API de Z.AI en %@ debe contener un objeto JSON.

# zai-api-key-store.error.malformed-key.unexpected-type
source: Z.AI API key file at %@ has an unexpected type.
es_419: El archivo de clave API de Z.AI en %@ tiene un tipo inesperado.

# zai-api-key-store.error.malformed-key.missing-api-key
source: Z.AI API key file at %@ is missing an api_key.
es_419: El archivo de clave API de Z.AI en %@ no tiene un api_key.

source: openai-compatibility must be an array of provider mappings.
es_419: openai-compatibility debe ser un array de mapeos de proveedores.

# config-composer.validation.path.must-be-mapping
source: %@ must be a mapping.
es_419: %@ debe ser un mapeo.

# config-composer.validation.path.must-define-string-name
source: %@ must define a string name.
es_419: %@ debe definir un nombre de tipo string.

# config-composer.validation.path.must-define-non-empty-name
source: %@ must define a non-empty name.
es_419: %@ debe definir un nombre no vacío.

# config-composer.validation.provider-name.must-not-include-edge-whitespace
source: Provider name '%@' must not include leading or trailing whitespace.
es_419: El nombre del proveedor "%@" no debe incluir espacios en blanco al inicio o al final.

# config-composer.validation.duplicate-openai-compatibility-provider
source: Duplicate openai-compatibility provider '%@' is not allowed.
es_419: El proveedor openai-compatibility duplicado '%@' no está permitido.

source: Provider '%@' is reserved and cannot be declared under openai-compatibility.
es_419: El proveedor '%@' está reservado y no puede declararse bajo openai-compatibility.

# config-composer.validation.api-key-path.must-be-mapping
source: %@ must be a mapping.
es_419: %@ debe ser un mapeo.

# config-composer.validation.api-key-path.must-define-non-empty-api-key
source: %@ must define a non-empty api-key.
es_419: %@ debe definir un api-key no vacío.

# config-composer.validation.path.api-key-entries.must-be-array-of-mappings
source: %@.api-key-entries must be an array of mappings.
es_419: %@.api-key-entries debe ser un array de mapeos.

# config-composer.validation.custom-provider.must-define-non-empty-base-url
source: Custom provider '%@' must define a non-empty base-url.
es_419: El proveedor personalizado '%@' debe definir un base-url no vacío.

# config-composer.validation.path.must-be-array-of-mappings
source: %@ must be an array of mappings.
es_419: %@ debe ser un array de mapeos.

# config-composer.validation.path-index.must-be-mapping
source: %@[%d] must be a mapping.
es_419: %@[%d] debe ser un mapeo.

# custom-provider-credential-store.error.no-stored-credential-for-provider
source: No stored credential was found for provider %@.
es_419: No se encontró ninguna credencial almacenada para el proveedor %@.

# custom-provider-credential-store.error.delete-credential-file-failed
source: Failed to delete credential file at %@: %@
es_419: No se pudo eliminar el archivo de credenciales en %@: %@

# custom-provider-credential-store.error.read-credential-file-failed
source: Failed to read credential file at %@: %@
es_419: No se pudo leer el archivo de credenciales en %@: %@

# custom-provider-credential-store.error.invalid-json
source: Credential file at %@ contains invalid JSON: %@
es_419: El archivo de credenciales en %@ contiene JSON inválido: %@

# custom-provider-credential-store.error.malformed-credential.not-json-object
source: Credential file at %@ must contain a JSON object.
es_419: El archivo de credenciales en %@ debe contener un objeto JSON.

# custom-provider-credential-store.error.malformed-credential.unexpected-type
source: Credential file at %@ has an unexpected type.
es_419: El archivo de credenciales en %@ tiene un tipo inesperado.

# custom-provider-credential-store.error.malformed-credential.missing-provider
source: Credential file at %@ is missing a provider.
es_419: Al archivo de credenciales en %@ le falta un proveedor.

# custom-provider-credential-store.error.malformed-credential.missing-api-key
source: Credential file at %@ is missing an api_key.
es_419: El archivo de credenciales en %@ no contiene api_key.

# custom-provider-credential-store.error.create-auth-directory-failed
source: Failed to create auth directory at %@: %@
es_419: No se pudo crear el directorio de autenticación en %@: %@

# custom-provider-credential-store.error.unexpected-load-error
source: Unexpected error while loading %@: %@
es_419: Error inesperado al cargar %@: %@

# custom-provider-credential-store.error.read-credential-record-file-failed
source: Failed to read credential file at %@: %@
es_419: No se pudo leer el archivo de credenciales en %@: %@

# custom-provider-credential-store.error.credential-record.invalid-json
source: Credential file at %@ contains invalid JSON: %@
es_419: El archivo de credenciales en %@ contiene JSON no válido: %@

# custom-provider-credential-store.error.credential-record.not-json-object
source: Credential file at %@ must contain a JSON object.
es_419: El archivo de credenciales en %@ debe contener un objeto JSON.

# custom-provider-credential-store.error.serialize-credential-failed
source: Failed to serialize credential for %@: %@
es_419: No se pudo serializar la credencial para %@: %@

# custom-provider-credential-store.error.write-credential-file-failed
source: Failed to write credential file at %@: %@
es_419: No se pudo escribir el archivo de credenciales en %@: %@

# settings.accounts.status.expired
source: (expired)
es_419: (expirado)

# settings.accounts.status.disabled
source: (disabled)
es_419: (deshabilitado)

# settings.accounts.action.enable
source: Enable
es_419: Habilitar

# settings.accounts.action.disable
source: Disable
es_419: Desactivar

# settings.accounts.error.at-least-one-enabled-required
source: At least one account must remain enabled
es_419: Al menos una cuenta debe permanecer habilitada

# settings.accounts.action.remove
source: Remove
es_419: Eliminar

# settings.vercel-gateway.toggle.use-vercel-ai-gateway
source: Use Vercel AI Gateway
es_419: Usar Vercel AI Gateway

# settings.vercel-gateway.description.route-claude-through-gateway
source: Route Claude requests through Vercel AI Gateway for safer access to your Claude Max subscription
es_419: Dirige las solicitudes de Claude a través de Vercel AI Gateway para un acceso más seguro a tu suscripción de Claude Max

# settings.vercel-gateway.field.vercel-api-key
source: Vercel API key
es_419: Clave API de Vercel

# settings.vercel-gateway.action.saved
source: Saved
es_419: Guardado

# settings.vercel-gateway.action.save
source: Save
es_419: Guardar

# settings.provider.action.disable-this-provider
source: Disable this provider
es_419: Desactivar este proveedor

# settings.provider.action.enable-this-provider
source: Enable this provider
es_419: Habilitar este proveedor

# settings.accounts.action.add-account
source: Add Account
es_419: Agregar cuenta

# settings.accounts.summary.connected-account-count
source: %d connected account(s)
es_419: %d cuenta(s) conectada(s)

# settings.accounts.feature.round-robin-auto-failover
source: • Round-robin w/ auto-failover
es_419: • Round-robin con failover automático

# settings.accounts.empty.no-connected-accounts
source: No connected accounts
es_419: No hay cuentas conectadas

# settings.accounts.confirm-remove.title
source: Remove Account
es_419: Eliminar cuenta

# settings.accounts.confirm-remove.action.cancel
source: Cancel
es_419: Cancelar

# settings.accounts.confirm-remove.action.remove
source: Remove
es_419: Eliminar

# settings.accounts.confirm-remove.message
source: Are you sure you want to remove %@ from %@?
es_419: ¿Estás seguro de que quieres eliminar %@ de %@?

# settings.api-keys.status.disabled
source: (disabled)
es_419: (deshabilitado)

# settings.api-keys.action.enable
source: Enable
es_419: Habilitar

# settings.api-keys.action.disable
source: Disable
es_419: Desactivar

# settings.api-keys.error.at-least-one-enabled-required
source: At least one API key must remain enabled
es_419: Al menos una clave API debe permanecer habilitada

# settings.api-keys.action.remove
source: Remove
es_419: Eliminar

# settings.api-keys.empty.no-configured-api-keys
source: No configured API keys
es_419: No hay claves API configuradas

# settings.api-keys.summary.total-config-added
source: %d API keys • %d in config • %d added here
es_419: %d claves API • %d en config • %d agregadas aquí

# settings.api-keys.summary.from-config
source: %d API key(s) from config
es_419: %d clave(s) API de la configuración

# settings.api-keys.summary.added-here
source: %d API key(s) added here
es_419: %d claves API agregadas aquí

# settings.api-keys.feature.pooled-across-available-keys
source: • Pooled across available keys
es_419: • Distribuido entre las claves disponibles

# settings.api-keys.models
source: Models: %@
es_419: Modelos: %@

# settings.api-keys.provider.action.disable-this-provider
source: Disable this provider
es_419: Desactivar este proveedor

# settings.api-keys.provider.action.enable-this-provider
source: Enable this provider
es_419: Habilitar este proveedor

# settings.api-keys.action.add-api-key
source: Add API Key
es_419: Agregar clave API

# settings.api-keys.using-from-config-path
source: Using %d API key(s) from ~/.cli-proxy-api/config.yaml
es_419: Usando %d clave(s) API de ~/.cli-proxy-api/config.yaml

# settings.api-keys.confirm-remove.title
source: Remove API Key
es_419: Eliminar clave API

# settings.api-keys.confirm-remove.action.cancel
source: Cancel
es_419: Cancelar

# settings.api-keys.confirm-remove.action.remove
source: Remove
es_419: Eliminar

# settings.api-keys.confirm-remove.message
source: Are you sure you want to remove %@ from %@?
es_419: ¿Estás seguro de que quieres eliminar %@ de %@?

# settings.server.status.title
source: Server status
es_419: Estado del servidor

# settings.server.status.running
source: Running
es_419: En ejecución

# settings.server.status.stopped
source: Stopped
es_419: Detenido

# settings.server.status.configuration-error
source: Configuration Error
es_419: Error de configuración

# settings.launch-at-login.toggle
source: Launch at login
es_419: Iniciar al iniciar sesión

# settings.auth-files.section-title
source: Auth files
es_419: Archivos de autenticación

# settings.auth-files.action.open-folder
source: Open Folder
es_419: Abrir carpeta

# settings.services.section-title
source: Services
es_419: Servicios

# settings.services.antigravity.description
source: Antigravity provides OAuth-based access to various AI models including Gemini and Claude. One login gives you access to multiple AI services.
es_419: Antigravity proporciona acceso basado en OAuth a varios modelos de IA, incluyendo Gemini y Claude. Un solo inicio de sesión te da acceso a múltiples servicios de IA.

# settings.services.claude-via-vercel.title
source: Claude Code (via Vercel)
es_419: Claude Code (vía Vercel)

# settings.services.gemini.multi-project-note
source: ⚠️ Note: If you're an existing Gemini user with multiple projects, authentication will use your default project. Set your desired project as default in Google AI Studio before connecting.
es_419: ⚠️ Nota: Si eres un usuario existente de Gemini con múltiples proyectos, la autenticación usará tu proyecto predeterminado. Establece tu proyecto deseado como predeterminado en Google AI Studio antes de conectar.

# settings.services.kimi.description
source: Kimi uses browser-based account authentication so you can route requests through your Kimi subscription instead of an API key.
es_419: Kimi utiliza autenticación de cuenta basada en navegador para que puedas enrutar solicitudes a través de tu suscripción de Kimi en lugar de una clave API.

# settings.services.github-copilot.description
source: GitHub Copilot provides access to Claude, GPT, Gemini and other models via your Copilot subscription.
es_419: GitHub Copilot proporciona acceso a Claude, GPT, Gemini y otros modelos a través de tu suscripción a Copilot.

# settings.services.zai-glm.description
source: Z.AI GLM provides access to GLM-4.7 and other models via API key. Get your key at https://z.ai/manage-apikey/apikey-list
es_419: Z.AI GLM proporciona acceso a GLM-4.7 y otros modelos mediante clave API. Obtén tu clave en https://z.ai/manage-apikey/apikey-list

# settings.custom-providers.section-title
source: Custom Providers
es_419: Proveedores personalizados

# settings.about.credits.vibeproxy-made-possible-thanks-to
source: VibeProxy %@ was made possible thanks to
es_419: VibeProxy %@ fue posible gracias a

# settings.about.license.mit
source: License: MIT
es_419: Licencia: MIT

# settings.about.copyright.all-rights-reserved
source: All rights reserved.
es_419: Todos los derechos reservados.

# settings.about.action.report-issue
source: Report an issue
es_419: Reportar un problema

# settings.qwen-account-email.title
source: Qwen Account Email
es_419: Email de cuenta de Qwen

# settings.qwen-account-email.prompt
source: Enter your Qwen account email address
es_419: Ingresa la dirección de email de tu cuenta de Qwen

# settings.qwen-account-email.placeholder.email-address
source: your.email@example.com
es_419: tu.email@ejemplo.com

# settings.qwen-account-email.action.cancel
source: Cancel
es_419: Cancelar

# settings.qwen-account-email.action.continue
source: Continue
es_419: Continuar

# settings.zai-api-key.title
source: Z.AI API Key
es_419: Clave API de Z.AI

# settings.zai-api-key.prompt
source: Enter your Z.AI API key from https://z.ai/manage-apikey/apikey-list
es_419: Ingresa tu clave API de Z.AI desde https://z.ai/manage-apikey/apikey-list

# settings.zai-api-key.action.cancel
source: Cancel
es_419: Cancelar

# settings.zai-api-key.action.add-key
source: Add Key
es_419: Agregar clave

# settings.custom-provider-api-key.title
source: %@ API Key
es_419: Clave API de %@

# settings.custom-provider-api-key.prompt
source: Enter an API key for %@
es_419: Ingresa una clave API para %@

# settings.custom-provider-api-key.action.cancel
source: Cancel
es_419: Cancelar

# settings.custom-provider-api-key.action.add-key
source: Add Key
es_419: Agregar clave

# settings.authentication-result.title
source: Authentication Result
es_419: Resultado de autenticación

# settings.authentication-result.enabled-account
source: ✓ Enabled %@
es_419: ✓ Habilitado %@

# settings.authentication-result.disabled-account
source: ✓ Disabled %@
es_419: ✓ Deshabilitado %@

# settings.authentication-result.failed-to-update-account
source: Failed to update %@. Please try again.
es_419: No se pudo actualizar %@. Inténtalo de nuevo.

# settings.authentication.code-copied
source: Code copied
es_419: Código copiado

# settings.authentication.error.failed-browser-check-details
source: Authentication failed. Please check if the browser opened and try again. Details: %@
es_419: La autenticación falló. Por favor verifica si se abrió el navegador e intenta de nuevo. Detalles: %@

# settings.authentication.error.no-output-from-process
source: No output from authentication process
es_419: Sin salida del proceso de autenticación

# settings.authentication.status.browser-opened.claude
source: 🌐 Browser opened for Claude Code authentication. Please complete the login in your browser. The app will automatically detect your credentials.
es_419: 🌐 Se abrió el navegador para autenticación de Claude Code. Por favor completa el inicio de sesión en tu navegador. La aplicación detectará automáticamente tus credenciales.

# settings.authentication.status.browser-opened.codex
source: 🌐 Browser opened for Codex authentication. Please complete the login in your browser. The app will automatically detect your credentials.
es_419: 🌐 Se abrió el navegador para autenticación de Codex. Por favor completa el inicio de sesión en tu navegador. La app detectará automáticamente tus credenciales.

# settings.authentication.status.github-copilot-device-flow-started
source: 🌐 GitHub Copilot authentication started! Please visit github.com/login/device and enter the code shown. The app will automatically detect your credentials.
es_419: 🌐 ¡Autenticación de GitHub Copilot iniciada! Visita github.com/login/device e ingresa el código que se muestra. La aplicación detectará automáticamente tus credenciales.

# settings.authentication.status.browser-opened.gemini
source: 🌐 Browser opened for Gemini authentication. Please complete the login in your browser. ⚠️ Note: If you have multiple projects, the default project will be used.
es_419: 🌐 Se abrió el navegador para autenticación de Gemini. Por favor completa el inicio de sesión en tu navegador. ⚠️ Nota: Si tienes múltiples proyectos, se usará el proyecto predeterminado.

# settings.authentication.status.browser-opened.kimi
source: 🌐 Browser opened for Kimi authentication. Please complete the login in your browser. The app will automatically detect your Kimi account.
es_419: 🌐 Se abrió el navegador para autenticación de Kimi. Por favor completa el inicio de sesión en tu navegador. La app detectará automáticamente tu cuenta de Kimi.

# settings.authentication.status.browser-opened.qwen
source: 🌐 Browser opened for Qwen authentication. Please complete the login in your browser.
es_419: 🌐 Se abrió el navegador para autenticación de Qwen. Por favor completa el inicio de sesión en tu navegador.

# settings.authentication.status.browser-opened.antigravity
source: 🌐 Browser opened for Antigravity authentication. Please complete the login in your browser.
es_419: 🌐 Se abrió el navegador para autenticación de Antigravity. Por favor completa el inicio de sesión en tu navegador.

# settings.authentication.status.zai-api-key-added-successfully
source: ✓ Z.AI API key added successfully. You can now use GLM models through the proxy.
es_419: ✓ Clave API de Z.AI agregada correctamente. Ahora puedes usar los modelos GLM a través del proxy.

# settings.authentication.error.failed-details
source: Authentication failed. Details: %@
es_419: La autenticación falló. Detalles: %@

# settings.authentication.error.no-output
source: No output
es_419: Sin salida

# settings.api-key.error.failed-to-save-details
source: Failed to save API key. Details: %@
es_419: No se pudo guardar la clave API. Detalles: %@

# settings.api-key.error.unknown-error
source: Unknown error
es_419: Error desconocido

# settings.api-key.status.saved-successfully
source: API key saved successfully
es_419: Clave API guardada correctamente

# settings.api-key.status.provider-key-added-successfully
source: ✓ %@ API key added successfully. You can now use this provider through the proxy.
es_419: ✓ Clave API de %@ agregada correctamente. Ahora puedes usar este proveedor a través del proxy.

# settings.api-key.error.already-exists-in-config
source: API key already exists in config
es_419: La clave API ya existe en la configuración

# settings.api-key.status.provider-already-has-key-in-config-path
source: ✓ %@ already has this API key in ~/.cli-proxy-api/config.yaml.
es_419: ✓ %@ ya tiene esta clave API en ~/.cli-proxy-api/config.yaml.

# settings.api-key.error.already-exists
source: API key already exists
es_419: La clave API ya existe

# settings.api-key.status.provider-already-has-key-stored
source: ✓ %@ already has this API key stored.
es_419: ✓ %@ ya tiene esta clave API almacenada.

# settings.api-key.status.already-stored-reenabled
source: API key was already stored and has been re-enabled
es_419: La clave API ya estaba almacenada y ha sido rehabilitada

# settings.api-key.status.provider-already-had-key-reenabled
source: ✓ %@ already had this API key stored, and it has been re-enabled.
es_419: ✓ %@ ya tenía esta clave API almacenada y ha sido rehabilitada.

# settings.api-key.error.failed-to-save-for-provider-details
source: Failed to save API key for %@. Details: %@
es_419: No se pudo guardar la clave API para %@. Detalles: %@

# settings.api-key.status.enabled-credential-for-provider
source: ✓ Enabled %@ for %@
es_419: ✓ Habilitado %@ para %@

# settings.api-key.status.disabled-credential-for-provider
source: ✓ Disabled %@ for %@
es_419: ✓ %@ deshabilitado para %@

# settings.api-key.error.failed-to-update-credential-for-provider
source: Failed to update %@ for %@. Please try again.
es_419: No se pudo actualizar %@ para %@. Intenta de nuevo.

# settings.api-key.status.removed-credential-from-provider
source: ✓ Removed %@ from %@
es_419: ✓ Se eliminó %@ de %@

# settings.api-key.error.failed-to-remove-credential-from-provider
source: Failed to remove %@ from %@
es_419: No se pudo eliminar %@ de %@
